<?xml version="1.0" ?>
<net name="shuff_epoch_120-224x224" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 224, 224"/>
			<output>
				<port id="0" names="input.1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="620" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="24, 3, 3, 3" size="2592"/>
			<output>
				<port id="0" names="620" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims3541" type="Const" version="opset1">
			<data element_type="f32" offset="2592" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="619" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="345" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="MaxPool_2" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3, 3" pads_begin="1, 1" pads_end="1, 1" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="346" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="623" type="Const" version="opset1">
			<data element_type="f32" offset="2688" shape="24, 1, 1, 3, 3" size="864"/>
			<output>
				<port id="0" names="623" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_3/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_3/Dims3577" type="Const" version="opset1">
			<data element_type="f32" offset="3552" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="622" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="626" type="Const" version="opset1">
			<data element_type="f32" offset="3648" shape="58, 24, 1, 1" size="5568"/>
			<output>
				<port id="0" names="626" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_4/Dims3589" type="Const" version="opset1">
			<data element_type="f32" offset="9216" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="625" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="351" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="629" type="Const" version="opset1">
			<data element_type="f32" offset="9448" shape="58, 24, 1, 1" size="5568"/>
			<output>
				<port id="0" names="629" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_6/Dims3499" type="Const" version="opset1">
			<data element_type="f32" offset="15016" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="628" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="354" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="632" type="Const" version="opset1">
			<data element_type="f32" offset="15248" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="632" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_8/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_8/Dims3601" type="Const" version="opset1">
			<data element_type="f32" offset="17336" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="631" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="635" type="Const" version="opset1">
			<data element_type="f32" offset="17568" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="635" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_9/Dims3559" type="Const" version="opset1">
			<data element_type="f32" offset="31024" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="634" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Relu_10" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="359" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Concat_11" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" names="360" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_12" type="Const" version="opset1">
			<data element_type="i64" offset="31256" shape="5" size="40"/>
			<output>
				<port id="0" names="361" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_13" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="362" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="333" type="Const" version="opset1">
			<data element_type="i64" offset="31296" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Transpose_14" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="363" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_15" type="Const" version="opset1">
			<data element_type="i64" offset="31336" shape="4" size="32"/>
			<output>
				<port id="0" names="364" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_16" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="365" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Split_17/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="31368" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="38" name="Split_17/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" offset="31376" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Split_17/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="366" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="4" names="367" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="638" type="Const" version="opset1">
			<data element_type="f32" offset="31392" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="638" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_18/Dims3697" type="Const" version="opset1">
			<data element_type="f32" offset="44848" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="637" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="370" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="641" type="Const" version="opset1">
			<data element_type="f32" offset="45080" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="641" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_20/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_20/Dims3631" type="Const" version="opset1">
			<data element_type="f32" offset="47168" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="640" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="644" type="Const" version="opset1">
			<data element_type="f32" offset="47400" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="644" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_21/Dims3643" type="Const" version="opset1">
			<data element_type="f32" offset="60856" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="643" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Relu_22" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="375" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Concat_23" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" names="376" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" offset="31256" shape="5" size="40"/>
			<output>
				<port id="0" names="377" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_25" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="378" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="340" type="Const" version="opset1">
			<data element_type="i64" offset="31296" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose_26" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="379" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_27" type="Const" version="opset1">
			<data element_type="i64" offset="31336" shape="4" size="32"/>
			<output>
				<port id="0" names="380" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_28" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="381" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Split_29/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="31368" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="62" name="Split_29/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" offset="31376" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Split_29/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="382" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="4" names="383" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="647" type="Const" version="opset1">
			<data element_type="f32" offset="61088" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="647" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_30/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_30/Dims3769" type="Const" version="opset1">
			<data element_type="f32" offset="74544" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_30" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="646" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Relu_31" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="386" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="650" type="Const" version="opset1">
			<data element_type="f32" offset="74776" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="650" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_32/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_32/Dims3685" type="Const" version="opset1">
			<data element_type="f32" offset="76864" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="649" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="653" type="Const" version="opset1">
			<data element_type="f32" offset="77096" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="653" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_33/Dims3727" type="Const" version="opset1">
			<data element_type="f32" offset="90552" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="652" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Relu_34" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="391" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Concat_35" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" names="392" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_36" type="Const" version="opset1">
			<data element_type="i64" offset="31256" shape="5" size="40"/>
			<output>
				<port id="0" names="393" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_37" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="394" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="338" type="Const" version="opset1">
			<data element_type="i64" offset="31296" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Transpose_38" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="395" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_39" type="Const" version="opset1">
			<data element_type="i64" offset="31336" shape="4" size="32"/>
			<output>
				<port id="0" names="396" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_40" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="397" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Split_41/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="31368" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="86" name="Split_41/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" offset="31376" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Split_41/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="398" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="4" names="399" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="656" type="Const" version="opset1">
			<data element_type="f32" offset="90784" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="656" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_42/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_42/Dims3595" type="Const" version="opset1">
			<data element_type="f32" offset="104240" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_42" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="655" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Relu_43" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="402" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="659" type="Const" version="opset1">
			<data element_type="f32" offset="104472" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="659" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_44/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_44/Dims3649" type="Const" version="opset1">
			<data element_type="f32" offset="106560" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="658" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="662" type="Const" version="opset1">
			<data element_type="f32" offset="106792" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="662" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_45/Dims3565" type="Const" version="opset1">
			<data element_type="f32" offset="120248" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_45" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="661" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_46" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="407" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Concat_47" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" names="408" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_48" type="Const" version="opset1">
			<data element_type="i64" offset="31256" shape="5" size="40"/>
			<output>
				<port id="0" names="409" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Reshape_49" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="410" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="334" type="Const" version="opset1">
			<data element_type="i64" offset="31296" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Transpose_50" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="411" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_51" type="Const" version="opset1">
			<data element_type="i64" offset="31336" shape="4" size="32"/>
			<output>
				<port id="0" names="412" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_52" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="413" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="665" type="Const" version="opset1">
			<data element_type="f32" offset="120480" shape="116, 1, 1, 3, 3" size="4176"/>
			<output>
				<port id="0" names="665" precision="FP32">
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_53/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_53/Dims3613" type="Const" version="opset1">
			<data element_type="f32" offset="124656" shape="1, 116, 1, 1" size="464"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_53" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="664" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="668" type="Const" version="opset1">
			<data element_type="f32" offset="125120" shape="116, 116, 1, 1" size="53824"/>
			<output>
				<port id="0" names="668" precision="FP32">
					<dim>116</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>116</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_54/Dims3793" type="Const" version="opset1">
			<data element_type="f32" offset="178944" shape="1, 116, 1, 1" size="464"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_54" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="667" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Relu_55" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="418" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="671" type="Const" version="opset1">
			<data element_type="f32" offset="179408" shape="116, 116, 1, 1" size="53824"/>
			<output>
				<port id="0" names="671" precision="FP32">
					<dim>116</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_56/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>116</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
